Repository: egrischenkov/flutter_design_patterns_app
Catalog: lib/l10n/fdp_*.arb
Languages: ru

# main_title
source: Flutter Design Patterns
ru: Паттерны Проектирования с Flutter

source: Theme
ru: Тема

source: Favorite
ru: Избранное

source: Nested route
ru: Вложенная навигация

# pattern_types
source: {patternTypeId, select, creational {Creational} structural {Structural} behavioral {Behavioral}}
ru: {patternTypeId, select, creational {Порождающие} structural {Структурные} behavioral {Поведенческие}}

# pattern_types_description
source: {patternTypeId, select, creational {Provide various object creation mechanisms.} structural {Assemble objects and classes into larger structures.} behavioral {Concerned the assignment of responsibilities between objects}}
ru: {patternTypeId, select, creational {Отвечают за создание новых объектов} structural {Отвечают за построение удобных иерархий классов} behavioral {Решают задачи взаимодействия между объектами программы}}

# patterns_name
source: {patternId, select, abstract_factory {Abstract factory} builder {Builder} factory_method {Factory method} prototype {Prototype} singleton {Singleton} adapter {Adapter} bridge {Bridge} composite {Composite} decorator {Decorator} facade {Facade} flyweight {Flyweight} proxy {Proxy} chain_of_responsibility {Chain of responsibility} command {Command} iterator {Iterator} mediator {Mediator} memento {Memento} observer {Observer} state {State} strategy {Strategy} template_method {Template method} visitor {Visitor}}
ru: {patternId, select, abstract_factory {Абстрактная фабрика} builder {Строитель} factory_method {Фабричный метод} prototype {Прототип} singleton {Одиночка} adapter {Адаптер} bridge {Мост} composite {Компоновщик} decorator {Декоратор} facade {Фасад} flyweight {Легковес} proxy {Заместитель} chain_of_responsibility {Цепочка обязанностей} command {Команда} iterator {Итератор} mediator {Посредник} memento {Снимок} observer {Наблюдатель} state {Состояние} strategy {Стратегия} template_method {Шаблонный метод} visitor {Посетитель}}

# patterns_description
source: {patternId, select, abstract_factory {Provide an interface for creating families of related or dependent objects without specifying their concrete classes} builder {Separate the construction of a complex object from its representation so that the same construction process can create different representations}, factory_method {Define an interface for creating an object, but let subclasses decide which class to instantiate. Factory Method lets a class defer instantiation to sub­classes} prototype {Specify the kinds of objects to create using a prototypical instance, and create new objects by copying this prototype} singleton {Ensure a class only has one instance, and provide a global point of access to it} adapter {Convert the interface of a class into another interface clients expect. Adapter lets classes work together that couldn't otherwise because of incompatible interfaces} bridge {Decouple an abstraction from its implementation so that the two can vary independently} composite {Compose objects into tree structures to represent part-whole hierarchies. Composite lets clients treat individual objects and compositions of objects uniformly} decorator {Attach additional responsibilities to an object dynamically. Decorators provide a flexible alternative to subclassing for extending functionality} facade {Provide an unified interface to a set of interfaces in a subsystem. Facade defines a higher-level interface that makes the subsystem easier to use} flyweight {Use sharing to support large numbers of fine-grained objects efficiently} proxy {Provide a surrogate or placeholder for another object to control access to it} chain_of_responsibility {Avoid coupling the sender of a request to its receiver by giving more than one object a chance to handle the request. Chain the receiving objects and pass the request along the chain until an object handles it} command {Encapsulate a request as an object, thereby letting you parameterize clients with different requests, queue or log requests, and support undoable opera­tions} iterator {Provide a way to access the elements of an aggregate object sequentially without exposing its underlying representation} mediator {Define an object that encapsulates how a set of objects interact. Mediator promotes loose coupling by keeping objects from referring to each other explicitly, and it lets you vary their interaction independently} memento {Without violating encapsulation, capture and externalize an object's internal state so that the object can be restored to this state later} observer {Define a one-to-many dependency between objects so that when one object changes state, all its dependents are notified and updated automatically} state {Allow an object to alter its behavior when its internal state changes. The object will appear to change its class} strategy {Define a family of algorithms, encapsulate each one, and make them interchange­able. Strategy lets the algorithm vary independently from clients that use it} template_method {Define the skeleton of an algorithm in an operation, deferring some steps to sub­classes. Template Method lets subclasses redefine certain steps of an algorithm without changing the algorithm's structure} visitor {Represent an operation to be performed on the elements of an object structure. Visitor lets you define a new operation without changing the classes of the elements on which it operates}}
ru: {patternId, select, abstract_factory {Позволяет создавать семейства связанных объектов, не привязываясь к конкретным классам создаваемых объектов} builder {Позволяет создавать сложные объекты пошагово. Строитель дает возможность использовать один и тот же код строительства для получения разных представлений объектов}, factory_method {Определяет общий интерфейс для создания объектов в суперклассе, позволяя подклассам изменять тип создаваемых объектов} prototype {Позволяет копировать объекты, не вдаваясь в подробности их реализации} singleton {Гарантирует, что у класса есть только один экземпляр, и предоставляет к нему глобальную точку доступа} adapter {Позволяет объектам в несовместимыми интерфейсами работать вместе} bridge {Разделяет один или несколько классов на две отдельные иерархии - абстракцию и реализацию, позволяя изменять их независимо друг от друга} composite {Позволяет сгруппировать множество объектов в древовидную структуру, а затем работать с ней как будто это единичный объект} decorator {Позволяет динамически добавлять объектам новую функциональность, оборачивая их в полезные “обертки”} facade {Предоставляет простой интерфейс к сложной системе классов, библиотеке или фреймворку} flyweight {Позволяет вместить большое количество объектов в отведенную оперативную память. Легковес экономит память, разделяя общее состояние объектов между собой, вместо хранения одинаковых данных в каждом объекте} proxy {Позволяет подставлять вместо реальных объектов специальные объекты-заменители} chain_of_responsibility {Позволяет передавать запросы последовательно по цепочке обработчиков. Каждый последующий обработчик решает, может ли он обработать запрос сам и стоит ли передавать запрос дальше по цепи} command {Превращает запросы в объекты, позволяя передавать их как аргументы при вызове методов, ставить запросы в очередь, легировать их, а также поддерживать подмену операций} iterator {Дает возможность последовательно обходить элементы составных объектов, не раскрывая внутреннего представления} mediator {Позволяет уменьшить связность множества классов между собой, благодаря перемещению этих связей в один класс-посредник} memento {Позволяет сохранять и восстанавливать прошлые состояния объектов, не раскрывая подробностей их реализации} observer {Создает механизм подписки, позволяющий одним объектам следить и реагировать на события, происходящие в других объектах} state {позволяет объектам менять свое поведение в зависимости от своего состояния. Извне создается впечатление, что изменился класс объекта} strategy {определяет семейство схожих алгоритмов и помещает каждый из них в собственный класс, после чего алгоритмы можно взаимозаменяем прямо во время исполнения программы} template_method {Определяет скелет алгоритма, перекладывая ответственность за некоторые его шаги на подклассы. Паттерн позволяет подклассам переопределять шаги алгоритма, не меняя его общей структуры} visitor {Позволяет добавлять в программу новые операции, не изменяя классы объектов, над которыми эти операции могут выполняться}}

# patterns
source: {COUNT} patterns
ru: {COUNT} паттернов

source: Example
ru: Пример

source: Description
ru: Описание

# warning_no_favorite
source: Oops, no favorite patterns yet!
ru: Ой, избранных паттернов пока что нет!

source: Language
ru: Язык

# add_to_favorite
source: {PATTERN} pattern add to favorite
ru: Паттерн {PATTERN} добавлен в избранное

# remove_from_favorite
source: {PATTERN} pattern remove from favorite
ru: Паттерн {PATTERN} удален из избранного
